[ {
  "title" : "The Walking Dead (season 8)",
  "query" : "when is the last episode of season 8 of the walking dead",
  "short_answer" : "March 18, 2018",
  "long_answer" : "No.\noverall\nNo. in\nseason\nTitle\nDirected by\nWritten by\nOriginal air date\nU.S. viewers\n(millions)\n\n\n100\n1\n\"Mercy\"\nGreg Nicotero\nScott M. Gimple\nOctober 22, 2017 (2017-10-22)\n11.44\n\n\nRick, Maggie, and Ezekiel rally their communities together to take down Negan. Gregory attempts to have the Hilltop residents side with Negan, but they all firmly stand behind Maggie. The group attacks the Sanctuary, taking down its fences and flooding the compound with walkers. With the Sanctuary defaced, everyone leaves except Gabriel, who reluctantly stays to save Gregory, but is left behind when Gregory abandons him. Surrounded by walkers, Gabriel hides in a trailer, where he is trapped inside with Negan.\n\n\n101\n2\n\"The Damned\"\nRosemary Rodriguez\nMatthew Negrete &amp; Channing Powell\nOctober 29, 2017 (2017-10-29)\n8.92\n\n\nRick's forces split into separate parties to attack several of the Saviors' outposts, during which many members of the group are killed; Eric is critically injured and rushed away by Aaron. Jesus stops Tara and Morgan from executing a group of surrendered Saviors. While clearing an outpost with Daryl, Rick is confronted and held at gunpoint by Morales, a survivor he met in the initial Atlanta camp, who is now with the Saviors.\n\n\n102\n3\n\"Monsters\"\nGreg Nicotero\nMatthew Negrete &amp; Channing Powell\nNovember 5, 2017 (2017-11-05)\n8.52\n\n\nDaryl finds Morales threatening Rick and kills him; the duo then pursue a group of Saviors who are transporting weapons to another outpost. Gregory returns to Hilltop, and after a heated argument, Maggie ultimately allows him back in the community. Eric dies from his injuries, leaving Aaron distraught. Despite Tara and Morgan's objections, Jesus leads the group of surrendered Saviors to Hilltop. Ezekiel's group attacks another Savior compound, during which several Kingdommers are shot while protecting Ezekiel.\n\n\n103\n4\n\"Some Guy\"\nDan Liu\nDavid Leslie Johnson\nNovember 12, 2017 (2017-11-12)\n8.69\n\n\nEzekiel's group is overwhelmed by the Saviors, who kill all of them except for Ezekiel himself and Jerry. Carol clears the inside of the compound, killing all but two Saviors, who almost escape but are eventually caught by Rick and Daryl. En route to the Kingdom, Ezekiel, Jerry, and Carol are surrounded by walkers, but Shiva sacrifices herself to save them. The trio returns to the Kingdom, where Ezekiel's confidence in himself as a leader has diminished.\n\n\n104\n5\n\"The Big Scary U\"\nMichael E. Satrazemis\nStory by : Scott M. Gimple &amp; David Leslie Johnson &amp; Angela Kang\nTeleplay by : David Leslie Johnson &amp; Angela Kang\nNovember 19, 2017 (2017-11-19)\n7.85\n\n\nAfter confessing their sins to each other, Gabriel and Negan manage to escape from the trailer. Simon and the other lieutenants grow suspicious of each other, knowing that Rick’s forces must have inside information. The workers in the Sanctuary become increasingly frustrated with their living conditions, and a riot nearly ensues, until Negan returns and restores order. Gabriel is locked in a cell, where Eugene discovers him sick and suffering. Meanwhile, Rick and Daryl argue over how to take out the Saviors, leading Daryl to abandon Rick.\n\n\n105\n6\n\"The King, the Widow, and Rick\"\nJohn Polson\nAngela Kang &amp; Corey Reed\nNovember 26, 2017 (2017-11-26)\n8.28\n\n\nRick visits Jadis in hopes of convincing her to turn against Negan; Jadis refuses, and locks Rick in a shipping container. Carl encounters Siddiq in the woods and recruits him to Alexandria. Daryl and Tara plot to deviate from Rick’s plans by destroying the Sanctuary. Ezekiel isolates himself at the Kingdom, where Carol tries to encourage him to be the leader his people need. Maggie has the group of captured Saviors placed in a holding area and forces Gregory to join them as punishment for betraying Hilltop.\n\n\n106\n7\n\"Time for After\"\nLarry Teng\nMatthew Negrete &amp; Corey Reed\nDecember 3, 2017 (2017-12-03)\n7.47\n\n\nAfter learning of Dwight's association with Rick's group, Eugene affirms his loyalty to Negan and outlines a plan to get rid of the walkers surrounding the Sanctuary. With help from Morgan and Tara, Daryl drives a truck through the Sanctuary’s walls, flooding its interior with walkers, killing many Saviors. Rick finally convinces Jadis and the Scavengers to align with him, and they plan to force the Saviors to surrender. However, when they arrive at the Sanctuary, Rick is horrified to see the breached walls and no sign of the walker herd.\n\n\n107\n8\n\"How It's Gotta Be\"\nMichael E. Satrazemis\nDavid Leslie Johnson &amp; Angela Kang\nDecember 10, 2017 (2017-12-10)\n7.89\n\n\nEugene's plan allows the Saviors to escape, and separately, the Saviors waylay the Alexandria, Hilltop, and Kingdom forces. The Scavengers abandon Rick, after which he returns to Alexandria. Ezekiel ensures that the Kingdom residents are able to escape before locking himself in the community with the Saviors. Eugene aids Gabriel and Doctor Carson in escaping the Sanctuary in order to ease his conscience. Negan attacks Alexandria, but Carl devises a plan to allow the Alexandria residents to escape into the sewers. Carl reveals he was bitten by a walker while escorting Siddiq to Alexandria.\n\n\n108\n9\n\"Honor\"\nGreg Nicotero\nMatthew Negrete &amp; Channing Powell\nFebruary 25, 2018 (2018-02-25)\n8.28\n\n\nAfter the Saviors leave Alexandria, the survivors make for the Hilltop while Rick and Michonne stay behind to say their final goodbyes to a dying Carl, who pleads with Rick to build a better future alongside the Saviors before killing himself. In the Kingdom, Morgan and Carol launch a rescue mission for Ezekiel. Although they are successful and retake the Kingdom, the Saviors' lieutenant Gavin is killed by Benjamin's vengeful brother Henry.\n\n\n109\n10\n\"The Lost and the Plunderers\"\nTBA\nTBA\nMarch 4, 2018 (2018-03-04)\nTBD\n\n\n110\n11\n\"Dead or Alive Or\"\nTBA\nTBA\nMarch 11, 2018 (2018-03-11)\nTBD\n\n\n111\n12\n\"The Key\"\nTBA\nTBA\nMarch 18, 2018 (2018-03-18)\nTBD"
}, {
  "title" : "Persephone",
  "query" : "in greek mythology who was the goddess of spring growth",
  "short_answer" : "Persephone (/pərˈsɛfəni/; Greek: Περσεφόνη), also called Kore (/ˈkɔːriː/; \"the maiden\")",
  "long_answer" : "In Greek mythology, Persephone (/pərˈsɛfəni/; Greek: Περσεφόνη), also called Kore (/ˈkɔːriː/; \"the maiden\"), is the daughter of Zeus and Demeter and is the queen of the underworld. Homer describes her as the formidable, venerable majestic princess of the underworld, who carries into effect the curses of men upon the souls of the dead. Persephone was married to Hades, the god of the underworld. The myth of her abduction represents her function as the personification of vegetation, which shoots forth in spring and withdraws into the earth after harvest; hence, she is also associated with spring as well as the fertility of vegetation. Similar myths appear in the Orient, in the cults of male gods like Attis, Adonis, and Osiris, and in Minoan Crete."
}, {
  "title" : "Judaism",
  "query" : "what is the name of the most important jewish text",
  "short_answer" : "the Shulchan Aruch",
  "long_answer" : "Halakha, the rabbinic Jewish way of life, then, is based on a combined reading of the Torah, and the oral tradition—the Mishnah, the halakhic Midrash, the Talmud and its commentaries. The Halakha has developed slowly, through a precedent-based system. The literature of questions to rabbis, and their considered answers, is referred to as responsa (in Hebrew, Sheelot U-Teshuvot.) Over time, as practices develop, codes of Jewish law are written that are based on the responsa; the most important code, the Shulchan Aruch, largely determines Orthodox religious practice today."
}, {
  "title" : "Football in Spain",
  "query" : "what is the name of spain's most famous soccer team",
  "short_answer" : "Real Madrid",
  "long_answer" : "In a survey of sports habits of the Spanish population made in 2010, football was the second most popular recreational sport practised by the population (17.9%). A total of 75.9% of people said they had ever bought tickets to attend a football match. In addition, a total of 67.3% of the people said that they saw all, almost all, many, or some of the football matches broadcast on television. In another survey made in 2014, the practice of football decreased to 14% of the population, being overtaken by other sports, such as running, cycling and swimming for recreation. However, in this survey football was still the sport that interests the majority of Spain’s people (48%). A total of 67% of the population said they were fans or had sympathy for a particular club. In addition, 74.9% said they watched, whenever possible, the matches broadcast on television regarding their favorite teams; and 42.4% had, flags, badges or objects of their favorite teams. Data of this survey confirmed the widespread impression that most of Spain’s people are supporters of Real Madrid (37.9%) or FC Barcelona (25.4%), and the other teams have fewer supporters nationwide, as Atlético de Madrid (16.1%), Valencia CF (3.5%), Athletic Bilbao (3.3.) or Sevilla FC (3.2%)."
}, {
  "title" : "Robot-assisted surgery",
  "query" : "when was the first robot used in surgery",
  "short_answer" : "1983",
  "long_answer" : "The first robot to assist in surgery was the Arthrobot, which was developed and used for the first time in Vancouver in 1983. Intimately involved were biomedical engineer, Dr. James McEwen, Geof Auchinleck, a UBC engineering physics grad, and Dr. Brian Day as well as a team of engineering students. The robot was used in an orthopaedic surgical procedure on 12 March 1984, at the UBC Hospital in Vancouver. Over 60 arthroscopic surgical procedures were performed in the first 12 months, and a 1985 National Geographic video on industrial robots, The Robotics Revolution, featured the device. Other related robotic devices developed at the same time included a surgical scrub nurse robot, which handed operative instruments on voice command, and a medical laboratory robotic arm. A YouTube video entitled Arthrobot illustrates some of these in operation."
}, {
  "title" : "I Love It (Icona Pop song)",
  "query" : "who sings the song i don't care i love it",
  "short_answer" : "Icona Pop and Charli XCX",
  "long_answer" : "The song's lyrics describe breaking up with an older boyfriend. In its chorus, Icona Pop and Charli XCX shout in unison \"I don't care / I love it\". Critics compared the song's breakup narrative to Kelly Clarkson's 2004 single \"Since U Been Gone\", and journalist Chuck Eddy wrote in a piece for Spin that the track's brattiness was similar to British band Shampoo."
}, {
  "title" : "Skywalker family",
  "query" : "who are uncle owen and aunt beru related to",
  "short_answer" : "Shmi",
  "long_answer" : "Star Wars: Episode II – Attack of the Clones reveals that, in Anakin's absence, Shmi has married Cliegg Lars, becoming the stepmother of Owen. Owen tells Anakin they are stepbrothers. Owen later marries Beru Whitesun. As a Jedi Knight, Anakin secretly marries Padmé Amidala."
}, {
  "title" : "Zimbabwe",
  "query" : "where is zimbabwe located in the world map",
  "short_answer" : "in southern Africa, between the Zambezi and Limpopo Rivers, bordered by South Africa, Botswana, Zambia and Mozambique",
  "long_answer" : "Zimbabwe (/zɪmˈbɑːbweɪ/), officially the Republic of Zimbabwe, is a landlocked country located in southern Africa, between the Zambezi and Limpopo Rivers, bordered by South Africa, Botswana, Zambia and Mozambique. The capital and largest city is Harare. A country of roughly 16 million people, Zimbabwe has 16 official languages, with English, Shona, and Ndebele the most commonly used."
}, {
  "title" : "Hectare",
  "query" : "100 acres is equal to how many hectares",
  "short_answer" : "1 square hectometre (hm2)",
  "long_answer" : "The hectare (/ˈhɛktɛər, -tɑːr/; SI symbol: ha) is an SI accepted metric system unit of area equal to 100 ares (10,000 m2) or 1 square hectometre (hm2) and primarily used in the measurement of land as a metric replacement for the imperial acre. An acre is about 0.405 hectare and one hectare contains about 2.47 acres."
}, {
  "title" : "Donovan Mitchell",
  "query" : "where was donovan mitchell picked in the draft",
  "short_answer" : "13th",
  "long_answer" : "Mitchell was drafted by the Denver Nuggets with the 13th overall pick in the 2017 NBA draft only to be traded to the Utah Jazz for the 24th pick (Tyler Lydon) and Trey Lyles. On July 5, 2017, Mitchell signed a four-year rookie scale contract with the Jazz. On July 11, 2017, Mitchell signed a multi-year shoe deal with Adidas. Later that day, Mitchell scored 37 points against the Memphis Grizzlies in the 2017 NBA Summer League in Las Vegas, the most by any player during the 2017 NBA Summer League. In his NBA debut on October 18, 2017, Mitchell registered 10 points and 4 assists against the Denver Nuggets. On December 1, 2017, he scored a career-high 41 points in a 114–108 win over the New Orleans Pelicans. He set the Jazz scoring record for a rookie and became the first NBA rookie to score 40 points in a game since Blake Griffin in 2011. He surpassed Darrell Griffith's team-record 38 in 1981. Mitchell also became the seventh rookie in franchise history to have a 30-plus point game, as well as the first to have a 40-plus point game. On January 4, 2018, Mitchell was named the Western Conference Rookie of the Month for December 2017 after averaging 23.1 points, 3.4 assists, 3.2 rebounds and 1.8 steals in 34.3 minutes per game during the month of December. On January 15, 2018, Mitchell surpassed Karl Malone for most 20+ points games during a rookie season when he had his 19th 20+ point game. On February 2, 2018 Donovan recorded his second 40 point game of his rookie season against the Phoenix Suns, becoming the first rookie guard to notch two 40-point games since Allen Iverson in 1996-97.  On February 5, 2018, Donovan was officially named by the NBA as an injury replacement for Orlando Magic forward Aaron Gordon (strained left hip flexor) for the 2018 NBA Slam Dunk Contest. He won the contest scoring a 48 and 50 in the first round, then a 50 and 48 in the final round being the first rookie to win the contest since Zach LaVine. On March 1, 2018, Mitchell was named as the Western Conference rookie of the month for the 3rd time this season for games played in February. On April 10, he set a rookie record for most three-pointers in a season with 186 three-pointers during a 119–79 win over the Golden State Warriors. On April 12, at the end of the regular season, Mitchell was named Western Conference Rookie of the Month for March and April."
}, {
  "title" : "The Beatles' rooftop concert",
  "query" : "where did the beatles final live performance take place",
  "short_answer" : "the roof of the headquarters of the band's multimedia corporation Apple Corps at 3 Savile Row",
  "long_answer" : "The Beatles' rooftop concert was the final public performance of the English rock band the Beatles. On 30 January 1969, the band, with keyboardist Billy Preston, surprised a central London office and fashion district with an impromptu concert from the roof of the headquarters of the band's multimedia corporation Apple Corps at 3 Savile Row. In a 42-minute set, the Beatles were heard playing nine takes of five songs before the Metropolitan Police Service asked them to reduce the volume. Footage from the performance was later used in the 1970 documentary film Let It Be."
}, {
  "title" : "Luis Guillermo Solís",
  "query" : "who is the president of costa rica 2017",
  "short_answer" : "Luis Guillermo Solís Rivera",
  "long_answer" : "Luis Guillermo Solís Rivera (born 25 April 1958) is a Costa Rican politician who has been President of Costa Rica since 2014. He is a member of the center-left Citizens' Action Party (PAC). Solís led the field in the 2014 presidential election, and he was effectively handed the presidency after the runner-up in the first round, San José mayor Johnny Araya Monge, ceased active campaigning. Solís has a long academic and political career, culminating in his election as the first President of Costa Rica to be a member of the PAC."
}, {
  "title" : "Power Rangers",
  "query" : "when did power rangers tv show come out",
  "short_answer" : "August 28, 1993",
  "long_answer" : "Power Rangers is an American entertainment and merchandising franchise built around a live action superhero television series. Produced first by Saban Entertainment, later by BVS Entertainment, and today by SCG Power Rangers, the television series takes much of its footage from the Japanese tokusatsu Super Sentai, produced by Toei Company. The first Power Rangers entry, Mighty Morphin Power Rangers, debuted on August 28, 1993, and helped launch the Fox Kids programming block of the 1990s, during which it catapulted into popular culture along with a line of action figures and other toys by Bandai. As of 2001[update], the media franchise has generated over $6 billion in retail sales worldwide."
}, {
  "title" : "Beverly Hills Cop (film series)",
  "query" : "how many beverly hills cops movies are there",
  "short_answer" : "three",
  "long_answer" : "Beverly Hills Cop is a series of American action comedy films and an unaired television pilot based on characters created by Daniel Petrie, Jr. and Danilo Bach. The films star Eddie Murphy as Axel Foley, a street-smart Detroit cop who travels to Beverly Hills, California to investigate crimes, even though it is out of his jurisdiction. There, he meets Detective Billy Rosewood (Judge Reinhold), Sergeant John Taggart (John Ashton), and Lieutenant Andrew Bogomil (Ronny Cox). Ashton and Cox do not appear in Beverly Hills Cop III. Murphy, Reinhold, and Gil Hill, who plays Axel's boss, Inspector Todd, are the only actors who appear in all three films. Harold Faltermeyer produced the now famous \"Axel F\" theme song heard throughout the series. The series as a whole have been distributed by Paramount Pictures. The films have made a total of $735,534,503[citation needed] at the worldwide box office."
}, {
  "title" : "List of Wimbledon ladies' singles champions",
  "query" : "who holds the most women's wimbledon titles",
  "short_answer" : "Martina Navratilova",
  "long_answer" : "Wimbledon Ladies’ Singles ChampionsLocation\nLondonUnited KingdomVenue\nAELTCGoverning body\nAELTC / LTACreated\n1884 (established)Open Era: 1968(51 editions)Surface\nGrass (1884–Present)Prize money\n£ 2,000,000 (2016)Trophy\nVenus Rosewater DishWebsite\naeltc2010.wimbledon.org/en_GB/about/history/rolls/ladiesroll.htmlMost titlesAmateur era\n7: Dorothea Lambert Chambers(challenge round)8: Helen Wills Moody (regular)Open era\n9: Martina NavratilovaMost consecutive titlesAmateur era\n3: Lottie DodSuzanne Lenglen(challenge round)4: Helen Wills Moody(regular)Open era\n6: Martina NavratilovaCurrent champion\nAngelique  Kerber(1st singles title)"
}, {
  "title" : "Jinx (children's game)",
  "query" : "where does jinx you owe me a coke come from",
  "short_answer" : "Jinx is a children's game with varying rules and penalties that occur when two people unintentionally speak the same word or phrase simultaneously",
  "long_answer" : "Jinx is a children's game with varying rules and penalties that occur when two people unintentionally speak the same word or phrase simultaneously."
}, {
  "title" : "Hickey (surname)",
  "query" : "where does the last name hickey come from",
  "short_answer" : "Irish origin",
  "long_answer" : "Hickey is a common surname of Irish origin. The original form is Ó hÍceadha, which is still used in Ireland. Notable people with the surname include:"
}, {
  "title" : "WWE Greatest Royal Rumble",
  "query" : "where is the greatest royal rumble taking place",
  "short_answer" : "Jeddah, Saudi Arabia",
  "long_answer" : "Greatest Royal Rumble was a professional wrestling pay-per-view event and WWE Network event promoted by WWE for their Raw and SmackDown brands. The event was held on April 27, 2018 at the King Abdullah Sports City's King Abdullah International Stadium in Jeddah, Saudi Arabia. The event was scheduled for 7:00 p.m. local time. It aired live in the United States at noon EDT, with a pre-show starting at 11 a.m. EDT. At the event, all men's main roster championships were defended, in addition to a 50-man Royal Rumble match."
}, {
  "title" : "Bugsy Malone",
  "query" : "who sang my name is tallulah in bugsy malone",
  "short_answer" : "Louise \"Liberty\" Williams",
  "long_answer" : "\"Bugsy Malone\" – Paul Williams\n\"Fat Sam's Grand Slam\" – Paul Williams\n\"Tomorrow\"\n\"Bad Guys\"\n\"I'm Feeling Fine\"\n\"My Name Is Tallulah\" - Louise \"Liberty\" Williams\n\"So You Wanna Be a Boxer?\"\n\"Ordinary Fool\"\n\"Down and Out\"\n\"You Give a Little Love\" – Paul Williams"
}, {
  "title" : "List of Toy Story characters",
  "query" : "what is andy's sisters name in toy story",
  "short_answer" : "Molly",
  "long_answer" : "In Toy Story 3, a Barbie appears to be one of the toys that Andy's sister, Molly, owns. In Sunnyside, she falls in love with Ken, but after Lotso's minions reset Buzz's personality, and reveal that they want to sacrifice Andy's old toys in order to protect themselves, she ingratiates herself with Ken in order to obtain the Buzz Lightyear manual that lets her friends reset Buzz to his original form. When she stands up to Lotso by saying that being treated fairly is better than living under his rule, Ken switches his allegiance to her and her friends. In the end credits of the film, they get back together and change Sunnyside, becoming its co-leaders, after Lotso is defeated."
}, {
  "title" : "It Wasn't Me",
  "query" : "who sings with shaggy on it wasn me",
  "short_answer" : "English-Jamaican singer Rikrok",
  "long_answer" : "\"It Wasn't Me\" is the first single from Jamaican-American reggae artist Shaggy's multi-Platinum studio album Hot Shot (2000). The song features vocals from English-Jamaican singer Rikrok."
}, {
  "title" : "St. Francis Preparatory School",
  "query" : "what is the largest catholic high school in america",
  "short_answer" : "St. Francis Preparatory School",
  "long_answer" : "St. Francis Preparatory School, commonly known as St. Francis Prep, is a private, independent Catholic college preparatory school in the Fresh Meadows neighborhood of the New York City Borough of Queens, in the State of New York. It is the largest non-diocesan Catholic high school in the United States. St. Francis is run by the Franciscan Brothers of Brooklyn, who maintain a residence on the top floor of the school. The school has a student body of about 2,750 students and graduates between 600 and 700 students annually."
}, {
  "title" : "History of the People's Republic of China",
  "query" : "who established the peoples republic of china in 1949",
  "short_answer" : "Mao Zedong",
  "long_answer" : "The history of the People's Republic of China details the history of mainland China since October 1, 1949, when, after a near complete victory by the Chinese Communist Party (CCP) in the Chinese Civil War, Mao Zedong proclaimed the People's Republic of China (PRC) from atop Tiananmen. The PRC has for several decades been synonymous with China, but it is only the most recent political entity to govern mainland China, preceded by the Republic of China (ROC) and thousands of years of imperial dynasties."
}, {
  "title" : "Take That Look Off Your Face",
  "query" : "who sang take that look off your face",
  "short_answer" : "Marti Webb",
  "long_answer" : "\"Take That Look Off Your Face\" is the title of a hit song by musical theatre composer Andrew Lloyd Webber. Collaborating with lyricist Don Black, it was written for the song cycle show Tell Me on a Sunday in 1978. It was sung and released by Marti Webb in 1980, and became a No.3 hit in the UK charts. The song was also popular in Ireland, and spent six weeks at number one. Later, Tell Me on a Sunday was combined with another Lloyd Webber work, Variations, to form an entire new show, Song and Dance."
}, {
  "title" : "Percy Fawcett",
  "query" : "who plays percy in the lost city of z",
  "short_answer" : "Charlie Hunnam",
  "long_answer" : "David Grann's The Lost City of Z was optioned by Brad Pitt's Plan B production company and Paramount Pictures. James Gray directed the film, which stars Charlie Hunnam as Fawcett and was released in April 2017."
}, {
  "title" : "Joanna Going",
  "query" : "who plays the first lady on house of cards",
  "short_answer" : "Joanna C. Going",
  "long_answer" : "Joanna C. Going (born July 22, 1963) is an American actress."
}, {
  "title" : "Old Course at St Andrews",
  "query" : "who owns st andrews golf course in scotland",
  "short_answer" : "The St Andrews Links Trust",
  "long_answer" : "The Old Course at St Andrews is considered the oldest golf course in the world, a public course over common land in St Andrews, Fife, Scotland. It is held in trust by The St Andrews Links Trust under an act of Parliament. The Royal and Ancient Golf Club of St Andrews club house sits adjacent to the first tee, although it is but one of many clubs that have playing privileges on the course, along with the general public."
}, {
  "title" : "College World Series",
  "query" : "which city and state hosts the annual college world series",
  "short_answer" : "Omaha, Nebraska",
  "long_answer" : "The College World Series, or CWS, is an annual June baseball tournament held in Omaha, Nebraska. The CWS is the culmination of the National Collegiate Athletic Association (NCAA) Division I Baseball Championship tournament—featuring 64 teams in the first round—which determines the NCAA Division I college baseball champion. The eight participating teams are split into two, four-team, double-elimination brackets, with the winners of each bracket playing in a best-of-three championship series."
}, {
  "title" : "The Mother (How I Met Your Mother)",
  "query" : "who is ted talking about in how i met your mother",
  "short_answer" : "Tracy McConnell",
  "long_answer" : "Tracy McConnell, better known as \"The Mother\", is the title character from the CBS television sitcom How I Met Your Mother. The show, narrated by Future Ted, tells the story of how Ted Mosby met The Mother. Tracy McConnell appears in 8 episodes from \"Lucky Penny\" to \"The Time Travelers\" as an unseen character; she was first seen fully in \"Something New\" and was promoted to a main character in season 9. The Mother is played by Cristin Milioti."
}, {
  "title" : "Grey's Anatomy (season 14)",
  "query" : "when does grey's anatomy season 14 premiere",
  "short_answer" : "September 28, 2017",
  "long_answer" : "Grey's Anatomy (season 14)\n\n\n\nPromotional poster\n\n\n\nStarring\n\n\n\nEllen Pompeo\nJustin Chambers\nChandra Wilson\nJames Pickens, Jr.\nKevin McKidd\nJessica Capshaw\nSarah Drew\nJesse Williams\nCaterina Scorsone\nCamilla Luddington\nKelly McCreary\nJason George\nMartin Henderson\nGiacomo Gianniotti\n\n\n\n\n\nCountry of origin\nUnited States\n\n\nNo. of episodes\n12\n\n\nRelease\n\n\nOriginal network\nABC\n\n\nOriginal release\nSeptember 28, 2017 (2017-09-28) – present\n\n\nSeason chronology\n\n\n\n← Previous\nSeason 13\n\n\n\n\nList of Grey's Anatomy episodes"
}, {
  "title" : "Blood gas tension",
  "query" : "the partial pressure of carbon dioxide in arterial blood is approximately",
  "short_answer" : "at sea level (765 mmHg) in arterial blood is between 35 mmHg and 45 mmHg",
  "long_answer" : "PaCO2 – Partial pressure of carbon dioxide at sea level (765 mmHg) in arterial blood is between 35 mmHg and 45 mmHg."
}, {
  "title" : "List of Full House and Fuller House characters",
  "query" : "what was uncle jesse's original last name on full house",
  "short_answer" : "Cochran",
  "long_answer" : "Jesse Katsopolis (portrayed by John Stamos; the character's last name in season one was Cochran, but was changed reportedly due to John Stamos wanting his character to better reflect his Greek heritage) is Danny's brother-in-law, Pam's younger brother, husband of Rebecca Donaldson and father of twin sons Nicky and Alex. Born Hermes Katsopolis (as revealed in the season five episode \"The Legend of Ranger Joe\"), he was named after his great-grandfather, who in turn is named after the Greek god of swiftness. However, he did not like his birth name, as other kids teased him for it; so when he was in kindergarten, he begged his parents to have his name changed to Jesse, thinking that one had to have a \"cool name\" to be in the in-crowd. As an adult, he was more confident with his true name, telling the girls about the Greek god of speed, and how his great-grandfather saved a village from a volcano, but still goes by Jesse."
}, {
  "title" : "Judge Mathis",
  "query" : "who pays the judgements on the judge mathis show",
  "short_answer" : "Greg Mathis",
  "long_answer" : "Judge Mathis is a syndicated arbitration-based reality court show presided over by the retired Judge of Michigan's 36th District Court, Greg Mathis. The syndicated series features Mathis adjudicating small claims disputes."
}, {
  "title" : "The Elf on the Shelf",
  "query" : "who made up the elf on the shelf",
  "short_answer" : "Chanda Bell",
  "long_answer" : "The Elf on the Shelf was written in 2004 by Carol Aebersold and daughter Chanda Bell over a cup of tea. Bell suggested they write a book about an old tradition of an elf sent from Santa who came to watch over them at Christmas time. Aebersold's other daughter, Christa Pitts, was recruited by the family to share her expertise in sales and marketing. Together, the trio devoted the next three years promoting their self-published book and attending book signings and trade shows."
}, {
  "title" : "Samuel Prescott",
  "query" : "who warned concord that the british were coming",
  "short_answer" : "Samuel Prescott",
  "long_answer" : "Samuel Prescott (August 19, 1751 – c. 1777) was a Massachusetts Patriot during the American Revolutionary War.  He is best remembered for his role in Paul Revere's \"midnight ride\" to warn the townspeople of Concord of the impending British army move to capture guns and gunpowder kept there at the beginning of the American Revolution.  He was the only participant in the ride to reach Concord."
}, {
  "title" : "Alone (TV series)",
  "query" : "who lasted the longest on alone season 2",
  "short_answer" : "David McIntyre",
  "long_answer" : "Name\nAge\nGender\nHometown\nCountry\nStatus\nRef.\n\n\nDavid McIntyre\n50\nMale\nKentwood, Michigan\nUnited States\nWinner - 66 days\n\n\n\nLarry Roberts\n44\nMale\nRush City, Minnesota\nUnited States\n64 days\n\n\n\nJose Martinez Amoedo\n45\nMale\nSanta Pola, Valencia\nSpain\n59 days\n\n\n\nNicole Apelian\n45\nFemale\nPortland, Oregon\nUnited States\n57 days\n\n\n\nJustin Vititoe\n35\nMale\nAugusta, Georgia\nUnited States\n35 days\n\n\n\nRandy Champagne\n28\nMale\nFlagstaff, Arizona &amp; Boulder, Utah\nUnited States\n21 days\n\n\n\nMike Lowe\n55\nMale\nLewis, Colorado\nUnited States\n21 days\n\n\n\nTracy Wilson\n44\nFemale\nAiken, South Carolina\nUnited States\n8 days\n\n\n\nMary Kate Green\n36\nFemale\nHomer, Alaska\nUnited States\n7 days(medically evacuated)\n\n\n\nDesmond White\n37\nMale\nCoolidge, Arizona\nUnited States\n~5 hours"
}, {
  "title" : "United States Forces Japan",
  "query" : "where is the us military base in japan",
  "short_answer" : "Yokota Air Base, Fussa, Western Tokyo",
  "long_answer" : "United States Forces Japan在日米軍\nUSFJCountry\n Japan United StatesSize\n50,000 (approx.)Headquarters\nYokota Air Base, Fussa, Western TokyoNickname(s)\nUSFJ"
}, {
  "title" : "Supreme Court of the United States",
  "query" : "who determines the size of the supreme court",
  "short_answer" : "Congress",
  "long_answer" : "Article III of the United States Constitution does not specify the number of justices. The Judiciary Act of 1789 called for the appointment of six \"judges\". Although an 1801 act would have reduced the size of the court to five members upon its next vacancy, an 1802 act promptly negated the 1801 act, legally restoring the court's size to six members before any such vacancy occurred. As the nation's boundaries grew, Congress added justices to correspond with the growing number of judicial circuits: seven in 1807, nine in 1837, and ten in 1863."
}, {
  "title" : "Tom Ellis (actor)",
  "query" : "who is the actor that plays lucifer on tv",
  "short_answer" : "Thomas John Ellis",
  "long_answer" : "Thomas John Ellis (born 17 November 1978), better known as Tom Ellis, is a Welsh actor. He is best known for playing Gary Preston in the sitcom Miranda (2009–2015) and Lucifer Morningstar in the television series Lucifer (2016–)."
}, {
  "title" : "Coat of arms of South Africa",
  "query" : "who designed the national coat of arms of south africa",
  "short_answer" : "Iaan Bekker",
  "long_answer" : "The design process was initiated when, in 1999, the Department of Arts, Culture, Science and Technology requested ideas for the new coat-of-arms from the public. A brief was then prepared based on the ideas received, along with input from the Cabinet. The Government Communication and Information System then approached Design South Africa to brief ten of the top designers. Three designers were chosen to present their concepts to the Cabinet.  Iaan Bekker's design was chosen."
}, {
  "title" : "Election Commission of India's Model Code of Conduct",
  "query" : "when does model code of conduct come into force",
  "short_answer" : "immediately on announcement of the election schedule by the commission",
  "long_answer" : "Election Commission of India's Model Code of Conduct is a set of guidelines issued by the Election Commission of India for conduct of political parties and candidates during elections mainly with respect to speeches, polling day, polling booths, election manifestos, processions and general conduct. These set of norms has been evolved with the consensus of political parties who have consented to abide by the principles embodied in the said code in its letter and spirit.The Model Code of Conduct comes into force immediately on announcement of the election schedule by the commission for the need of ensuring free and fair elections. Much of it is designed to avert communal clashes and corrupt practices. For example, politicians should not make hate speeches, putting one community against another or make promises about new projects that may sway a voter."
}, {
  "title" : "Now That's What I Call Music (original UK album)",
  "query" : "when did now thats what i call music come out",
  "short_answer" : "28 November 1983",
  "long_answer" : "Now That's What I Call Music (also simply titled Now or Now 1) is the first album from the popular Now! series that was released in the United Kingdom on 28 November 1983. Initial pressings were released on vinyl and audio cassette. To celebrate the 25th anniversary of the album and series, the album was re-released on CD for the first time in 2009.  However, alternative longer mixes of Only For Love, Double Dutch and Candy Girl were included in place of the original shorter single mixes from 1983. A double vinyl re-release followed for Record Store Day on 18 April 2015. In July 2018, the album was newly remastered and re-released on CD, vinyl and cassette to commemorate the release of the 100th volume of the series."
}, {
  "title" : "106th Grey Cup",
  "query" : "where is the 2018 grey cup being played",
  "short_answer" : "The Brick Field at Commonwealth Stadium in Edmonton, Alberta",
  "long_answer" : "The game is scheduled to be played at The Brick Field at Commonwealth Stadium in Edmonton, Alberta on Sunday, November 25, 2018."
}, {
  "title" : "Bastille (band)",
  "query" : "where did the band bastille get their name",
  "short_answer" : "Bastille Day",
  "long_answer" : "Bastille (stylised as BΔSTILLE) are a British rock band formed in 2010. The group began as a solo project by lead vocalist Dan Smith, but later expanded to include keyboardist Kyle Simmons, bassist and guitarist Will Farquarson, and drummer Chris Wood. The name of the band derives from Bastille Day, which is celebrated on 14 July, the date of Smith's birthday."
}, {
  "title" : "Arkansas River",
  "query" : "where is arkansas river located on a map",
  "short_answer" : "The Arkansas River flows through Colorado, Kansas, Oklahoma, and Arkansas, and its watershed also drains parts of Texas, New Mexico and Missouri.",
  "long_answer" : "Arkansas River\n\n\nRiver\n\n\n\n\nThe lower part of the Arkansas River near Little Rock, Arkansas\n\n\n\nCountry\nUnited States\n\n\nStates\nColorado, Kansas, Oklahoma, Arkansas\n\n\nRegion\nGreat Plains\n\n\n\n\n\nPart of\nMississippi River watershed\n\n\nTributaries\n\n\n - left\nFountain Creek, Pawnee River, Little Arkansas River, Walnut River, Verdigris River, Neosho River\n\n\n - right\nCimarron River, Salt Fork Arkansas River, Canadian River, Poteau River\n\n\nCities\nPueblo, CO, Wichita, KS, Tulsa, OK, Muskogee, OK, Fort Smith, AR, Little Rock, AR, Pine Bluff, AR\n\n\n\n\n\n\n\n\nSource\nConfluence of East Fork Arkansas River and Tennessee Creek\n\n\n - location\nNear Leadville, Rocky Mountains, Colorado\n\n\n - elevation\n9,728 ft (2,965 m)\n\n\n - coordinates\n39°15′30″N 106°20′38″W﻿ / ﻿39.25833°N 106.34389°W﻿ / 39.25833; -106.34389 \n\n\nMouth\nMississippi River\n\n\n - location\nFranklin Township, Desha County, near Napoleon, Arkansas\n\n\n - elevation\n108 ft (33 m) \n\n\n - coordinates\n33°46′30″N 91°04′15″W﻿ / ﻿33.77500°N 91.07083°W﻿ / 33.77500; -91.07083Coordinates: 33°46′30″N 91°04′15″W﻿ / ﻿33.77500°N 91.07083°W﻿ / 33.77500; -91.07083 \n\n\n\n\n\nLength\n1,469 mi (2,364 km), West-east \n\n\nBasin\n168,002 sq mi (435,123 km2) \n\n\nDischarge\nfor Dardanelle, Arkansas, river mile 219.5 (river kilometer 353.3)\n\n\n - average\n40,517 cu ft/s (1,147 m3/s) \n\n\n - max\n683,000 cu ft/s (19,340 m3/s)\n\n\n - min\n1,207 cu ft/s (34 m3/s)\n\n\n\n\n\n\n\nThe Arkansas River flows through Colorado, Kansas, Oklahoma, and Arkansas, and its watershed also drains parts of Texas, New Mexico and Missouri."
}, {
  "title" : "The Princess Diaries 2: Royal Engagement",
  "query" : "who plays nicholas in the princess diaries 2",
  "short_answer" : "Chris Pine",
  "long_answer" : "Most of the cast returned from the first film, including Julie Andrews, Anne Hathaway, Héctor Elizondo, Heather Matarazzo, and Larry Miller. Garry Marshall returned to direct and Debra Martin Chase to produce. New characters include Viscount Mabrey (John Rhys-Davies), Lord Nicholas Devereaux (Chris Pine), and Andrew Jacoby (Callum Blue)."
}, {
  "title" : "P wave (electrocardiography)",
  "query" : "the p-wave phase of an electrocardiogram (ecg) represents",
  "short_answer" : "atrial depolarization",
  "long_answer" : "The P wave in the ECG represents atrial depolarization, which results in atrial contraction, or atrial systole."
}, {
  "title" : "Star Trek: The Next Generation",
  "query" : "when did star trek the next generation first air",
  "short_answer" : "September 28, 1987",
  "long_answer" : "Season\nEpisodes\nOriginally aired\n\n\nFirst aired\nLast aired\n\n\n\n1\n26\nSeptember 28, 1987 (1987-09-28)\nMay 16, 1988 (1988-05-16)\n\n\n\n2\n22\nNovember 21, 1988 (1988-11-21)\nJuly 17, 1989 (1989-07-17)\n\n\n\n3\n26\nSeptember 25, 1989 (1989-09-25)\nJune 18, 1990 (1990-06-18)\n\n\n\n4\n26\nSeptember 24, 1990 (1990-09-24)\nJune 17, 1991 (1991-06-17)\n\n\n\n5\n26\nSeptember 23, 1991 (1991-09-23)\nJune 15, 1992 (1992-06-15)\n\n\n\n6\n26\nSeptember 21, 1992 (1992-09-21)\nJune 21, 1993 (1993-06-21)\n\n\n\n7\n26\nSeptember 20, 1993 (1993-09-20)\nMay 23, 1994 (1994-05-23)"
}, {
  "title" : "Robin Ward (singer)",
  "query" : "who sang the most wonderful summer of my life",
  "short_answer" : "Jackie Ward",
  "long_answer" : "Jackie Ward (born Jacqueline McDonnell, 1941), better known as Robin Ward, is an American singer, regarded as a \"one-hit wonder\" of 1963 million-selling song \"Wonderful Summer\". However, using her real name she was highly accomplished and successful singing in groups. Ward's voice is heard in U.S. television series, motion pictures, advertisements, and pop records. She is one of the real singers of the hits attributed to The Partridge Family."
}, {
  "title" : "On Golden Pond (1981 film)",
  "query" : "how many oscars did on golden pond win",
  "short_answer" : "three",
  "long_answer" : "The film received ten nominations at the 54th Academy Awards including Best Picture and won three: Best Actor (Fonda), Best Actress (Hepburn) and Best Adapted Screenplay (Thompson). Henry Fonda won his only competitive Oscar with this movie and at the age of 76, he became the oldest winner in the aforementioned category. Katharine Hepburn won her fourth Best Actress award, extending her own record for the most Oscars won by a thespian. On Golden Pond is also one of the few movies to earn the nominations for five major Academy Awards (Best Picture, Director, Actor, Actress, and Screenplay)."
}, {
  "title" : "America's Got Talent (season 4)",
  "query" : "who won season 4 of america's got talent",
  "short_answer" : "Kevin Skinner",
  "long_answer" : "The fourth season of America's Got Talent, an American television reality show talent competition, premiered on the NBC network on June 23, 2009. Country singer Kevin Skinner was named the winner on September 16, 2009. This season is the first season to be broadcast in high definition."
}, {
  "title" : "Queen of the South (TV series)",
  "query" : "how many episodes on queen of the south season 1",
  "short_answer" : "13",
  "long_answer" : "Season\nEpisodes\nOriginally aired\n\n\nFirst aired\nLast aired\n\n\n\n1\n13\nJune 23, 2016 (2016-06-23)\nSeptember 15, 2016 (2016-09-15)\n\n\n\n2\n13\nJune 8, 2017 (2017-06-08)\nAugust 31, 2017 (2017-08-31)"
}, {
  "title" : "List of Prime Ministers of Pakistan",
  "query" : "who is the existing prime minister of pakistan",
  "short_answer" : "Imran Khan",
  "long_answer" : "List of Prime Ministers of Pakistan\nhide\n\nTerm Number\n\nPortrait\n\nName\n\nTook office\n\nLeft office\n\nTenure\n\nElections\n\nPolitical party(Alliance)\n\nNote(s)\n\n\n1\n\n\n\nLiaquat Ali Khan\n\n14 August 1947\n\n16 October 1951(assassinated)\n\n4 Years,2 Months,2 Days,\n\n—\n\nMuslim League\n\n\n\nFollowing advice given by the founding father of the nation, Governor-General Muhammad Ali Jinnah appointed and invited the Finance Minister Liaquat Ali Khan to set up and run his administration in 1947. He was assassinated in 1951, and Khawaja Nazimuddin took the office.\n\n\n2\n\n\n\nSir Khawaja Nazimuddin\n\n17 October 1951\n\n17 April 1953\n\n1 Year,6 Months,\n\n—\n\nMuslim League\n\n\n\nNazimuddin became Prime Minister of Pakistan after the assassination of Liaquat Ali Khan in 1951. He left the office when Governor-General Malik Ghulam Muhammad dissolved his government in 1953.\n\n\n3\n\n\n\nMohammad Ali Bogra\n\n17 April 1953\n\n12 August 1955\n\n2 Years,3 Months,26 Days,\n\n—\n\nMuslim League\n\n\n\nA diplomat and relatively unknown personality to Pakistani politics, Bogra established the Ministry of Talents but his administration was dismissed in 1955 by the Governor-General after the legislative elections in 1954.\n\n\n4\n\n\n\nChaudhry Mohammad Ali\n\n12 August 1955\n\n12 September 1956\n\n1 Year,1 Month,\n\n—\n\nMuslim League\n\n\n\nA first appointment from the coalition of Muslim League, Awami League and the Republican Party, he was removed by his own party following the successful vote of no-confidence movement.\n\n\n5\n\n\n\nHuseyn Shaheed Suhrawardy\n\n12 September 1956\n\n17 October 1957\n\n1 Year,1 Month,5 Days,\n\n—\n\nAwami League\n\n\n\nPopular for his wit in law, Suhrwardy resigned due to the loss of control over his party and support from the coalition partners in his administration.\n\n\n6\n\n\n\nIbrahim Ismail Chundrigar\n\n17 October 1957\n\n16 December 1957\n\n1 Month,29 Days,\n\n—\n\nMuslim League\n\n\n\nShortest tenured Prime Minister, Chundrigar established his administration but removed in mere 55 days into his term amid a vote of no-confidence movement led by majority votes of the Republican Party and Awami League.\n\n\n7\n\n\n\nSir Feroze Khan Noon\n\n16 December 1957\n\n7 October 1958\n\n9 Months,21 Days,\n\n—\n\nRepublican Party\n\n\n\nA lawyer, Sir Feroze Khan's administration collapsed after his party's own President Iskander Mirza enforced martial law in 1958 in a view of extending his term of office\n\n\n\n7 October 1958 – 7 December 1971\n\n\n8\n\n\n\nNurul Amin\n\n7 December 1971\n\n20 December 1971\n\n13 Days,\n\n1970\n\nPakistan Muslim League\n\n\n\nAfter the general elections in 1971, Amin was invited to be appointed as Prime Minister under Yahya administration; yet he was also the first and the only Vice President of Pakistan from 1970 to 1972, leading Pakistan in the Indo-Pakistani War of 1971.\n\n\n20 December 1971 – 14 August 1973\n\n\n9\n\n\n\nZulfikar Ali Bhutto\n\n14 August 1973\n\n5 July 1977\n\n3 Years,10 Months,21 Days,\n\n1973\n\nPakistan Peoples Party\n\n\n\nBhutto resigned as president to become the empowered Prime Minister after the Constitution was repromulgated, which established a parliamentary system of government. He was deposed in the martial law in 1977 by his appointed army chief, General Zia, in July 1977.\n\n\n\n5 July 1977 – 24 March 1985\n\n\n10\n\n\n\nMuhammad Khan Junejo\n\n24 March 1985\n\n29 May 1988\n\n3 Years,2 Months,5 Days,\n\n1985\n\nPakistan Muslim League (Independent)\n\n\n\nJunejo was elected as the tenth Prime Minister of Pakistan in non-party based elections in 1985, therefore he was elected on an Independent ticket but he served the Pakistan Muslim League while before entering in office and during office. He was dismissed by the president after Eighth Amendment to the Constitution.\n\n\n29 May 1988 – 2 December 1988\n\n\n11\n\n\n\nBenazir Bhutto\n\n2 December 1988\n\n6 August 1990\n\n1 Year,8 Months,4 Days,\n\n1988\n\nPakistan Peoples Party\n\n\n\nBhutto became the first woman in Pakistan to head a major political party, in 1982. Six years later, she became the first woman elected to lead a Muslim state.\n\n\n12\n\n\n\nNawaz Sharif\n\n6 November 1990\n\n18 July 1993\n\n2 Years,7 Months,4 Days,\n\n1990\n\nPakistan Muslim League (N)\n\n\n\nSharif was elected as the 12th Prime Minister of Pakistan on 1 November 1990. President Ghulam Ishaq Khan dissolved his government in April 1993, which was later on reinstated by the Supreme Court of Pakistan. Sharif survived a serious constitutional crisis when President Khan attempted to dismiss him under article 58-2b, in April 1993, but he successfully challenged the decision in the Supreme Court. Sharif resigned from the post negotiating a settlement that resulted in the removal of President as well, in July 1993.\n\n\n13\n\n\n\nBenazir Bhutto\n\n19 October 1993\n\n5 November 1996\n\n3 Years,17 Days,\n\n1993\n\nPakistan Peoples Party\n\n\n\nBhutto was re-elected for a second term, in 1993. She survived an attempted coup d'état in 1995. Bhutto's government was dismissed by president Farooq Leghari in November 1996.\n\n\n14\n\n\n\nNawaz Sharif\n\n17 February 1997\n\n12 October 1999\n\n2 Years,7 Months,25 Days.\n\n1997\n\nPakistan Muslim League (N)\n\n\n\nSharif was re-elected as Prime Minister with an exclusive mandate from all over Pakistan for a non-consecutive second term, in February 1997. His government was deposed by General Pervez Musharraf in October 1999, and Martial law was imposed in the entire country.\n\n\n12 October 1999 – 23 November 2002\n\n\n15\n\n\n\nMir Zafarullah Khan Jamali\n\n23 November 2002\n\n26 June 2004\n\n1 Year,7 Months,3 Days,\n\n2002\n\nPakistan Muslim League (Q)\n\n\n\nJamali was elected as the Prime Minister of Pakistan in November 2002. He continued the foreign and economic policies of Pervez Musharraf but could not complete his term and resigned from the post in June 2004.\n\n\n\n26 June 2004 – 30 June 2004\n\n\n16\n\n\n\nChaudhry Shujaat Hussain\n\n30 June 2004\n\n26 August 2004\n\n1 Month,27 Days,\n\n—\n\nPakistan Muslim League (Q)\n\n\n\nParliament elected Chaudhry Shujaat Hussain as the Prime Minister and to serve a 50-day period before the Shaukat Aziz, permanently replaces him.\n\n\n\n26 August 2004 – 28 August 2004\n\n\n17\n\n\n\nShaukat Aziz\n\n28 August 2004\n\n15 November 2007\n\n3 Years,2 Months,18 Days,\n\n—\n\nPakistan Muslim League (Q)\n\n\n\nAziz took the office of Prime Minister of Pakistan in August 2004. He left the office at the end of the parliamentary term, in November 2007, and became the first Prime Minister of Pakistan who left the seat after completion of parliamentary term.\n\n\n18\n\n\n\nYousaf Raza Gillani\n\n25 March 2008\n\n19 June 2012\n\n4 Years,2 Months,25 Days.\n\n2008\n\nPakistan Peoples Party\n\n\n\nGillani was elected as prime minister in March 2008. He was disqualified from his seat in the parliament in April 2012 by the Supreme Court for contempt of court.\n\n\n19\n\n\n\nRaja Pervaiz Ashraf\n\n22 June 2012\n\n24 March 2013\n\n9 Months,2 Days,\n\n—\n\nPakistan Peoples Party\n\n\n\nAshraf assumed the post of Prime Minister in June 2012, after Yousaf Raza Gillani was disqualified over contempt of court charges.\n\n\n20\n\n\n\nNawaz Sharif\n\n5 June 2013\n\n28 July 2017\n\n4 Years,1 Month,23 Days,\n\n2013\n\nPakistan Muslim League (N)\n\n\n\nOn 5 June 2013, Sharif took office for a third non-consecutive term.  He was disqualified on 28 July 2017 by the Supreme Court of Pakistan as a result of the Panama Papers case.\n\n\n\n29 July 2017 – 1 August 2017\n\n\n21\n\n\n\nShahid Khaqan Abbasi\n\n1 August 2017\n\n31 May 2018\n\n10 months\n\n—\n\nPakistan Muslim League (N)\n\n\n\nParliament elected Shahid Khaqan Abbasi as the Prime Minister after the disqualification of Nawaz Sharif. His term expired on May 31, 2018 alongside the dissolution of the National Assembly to facilitate a caretaker government in place until the 25 July general election.\n\n\n22[n 1]\n\n\n\nImran Khan\n\n18 August 2018\n\nIncumbent\n\n73 days\n\n2018\n\nPakistan Tehreek-e-Insaf\n\n\n\nGeneral elections were held on the 25th July 2018, which resulted in the Pakistan Tehreek-e-Insaf becoming the largest party. On August 18, 2018, Imran Khan was sworn in as Prime Minister after being elected by the National Assembly with 176 votes."
}, {
  "title" : "Stephen F. Austin",
  "query" : "who is known as the father of texas",
  "short_answer" : "Stephen Fuller Austin",
  "long_answer" : "Stephen Fuller Austin (November 3, 1793 – December 27, 1836) was an American empresario. Known as the \"Father of Texas\", and the founder of Texas, he led the second, and ultimately, the successful colonization of the region by bringing 300 families from the United States to the region in 1825."
}, {
  "title" : "Tobiko",
  "query" : "what is the orange stuff on my sushi",
  "short_answer" : "tobiko",
  "long_answer" : "The eggs are small, ranging from 0.5 to 0.8 mm. For comparison, tobiko is larger than masago (capelin roe), but smaller than ikura (salmon roe). Natural tobiko has a red-orange color, a mild smoky or salty taste, and a crunchy texture."
}, {
  "title" : "State of Origin series",
  "query" : "when did nsw last won a state of origin series",
  "short_answer" : "2018",
  "long_answer" : "State of Origin series\n\nYear\nWinner\nWins\nLosses\nDrawn\nShield Holder\n\n\n\n1982\nQueensland\n2\n1\n0\nQueensland\n\n\n1983\nQueensland\n2\n1\n0\nQueensland\n\n\n1984\nQueensland\n2\n1\n0\nQueensland\n\n\n1985\nNew South Wales\n2\n1\n0\nNew South Wales\n\n\n1986\nNew South Wales\n3\n0\n0\nNew South Wales\n\n\n1987\nQueensland\n2\n1\n0\nQueensland\n\n\n1988\nQueensland\n3\n0\n0\nQueensland\n\n\n1989\nQueensland\n3\n0\n0\nQueensland\n\n\n1990\nNew South Wales\n2\n1\n0\nNew South Wales\n\n\n1991\nQueensland\n2\n1\n0\nQueensland\n\n\n1992\nNew South Wales\n2\n1\n0\nNew South Wales\n\n\n1993\nNew South Wales\n2\n1\n0\nNew South Wales\n\n\n1994\nNew South Wales\n2\n1\n0\nNew South Wales\n\n\n1995\nQueensland\n3\n0\n0\nQueensland\n\n\n1996\nNew South Wales\n3\n0\n0\nNew South Wales\n\n\n1997\nNew South Wales\n2\n1\n0\nNew South Wales\n\n\n1998\nQueensland\n2\n1\n0\nQueensland\n\n\n1999\nDraw\n1\n1\n1\nQueensland\n\n\n2000\nNew South Wales\n3\n0\n0\nNew South Wales\n\n\n2001\nQueensland\n2\n1\n0\nQueensland\n\n\n2002\nDraw\n1\n1\n1\nQueensland\n\n\n2003\nNew South Wales\n2\n1\n0\nNew South Wales\n\n\n2004\nNew South Wales\n2\n1\n0\nNew South Wales\n\n\n2005\nNew South Wales\n2\n1\n0\nNew South Wales\n\n\n2006\nQueensland\n2\n1\n0\nQueensland\n\n\n2007\nQueensland\n2\n1\n0\nQueensland\n\n\n2008\nQueensland\n2\n1\n0\nQueensland\n\n\n2009\nQueensland\n2\n1\n0\nQueensland\n\n\n2010\nQueensland\n3\n0\n0\nQueensland\n\n\n2011\nQueensland\n2\n1\n0\nQueensland\n\n\n2012\nQueensland\n2\n1\n0\nQueensland\n\n\n2013\nQueensland\n2\n1\n0\nQueensland\n\n\n2014\nNew South Wales\n2\n1\n0\nNew South Wales\n\n\n2015\nQueensland\n2\n1\n0\nQueensland\n\n\n2016\nQueensland\n2\n1\n0\nQueensland\n\n\n2017\nQueensland\n2\n1\n0\nQueensland\n\n\n2018\nNew South Wales\n2\n1\n0\nNew South Wales"
}, {
  "title" : "Life Is Strange: Before the Storm",
  "query" : "when does life is strange before the storm part 2",
  "short_answer" : "October 2017",
  "long_answer" : "Life Is Strange: Before the Storm\n\n\n\n\n\nDeveloper(s)\nDeck Nine[a]\n\n\nPublisher(s)\nSquare Enix\n\n\nDirector(s)\n\n\n\nWebb Pickersgill\nChris Floyd\n\n\n\n\n\nProducer(s)\n\n\n\nDavid Lawrence Hein\nZoe Brown\n\n\n\n\n\nDesigner(s)\nWilliam Beacham\n\n\nProgrammer(s)\n\n\n\nMark Lyons\nDanielle Cheah\n\n\n\n\n\nArtist(s)\nAndrew Weatherl\n\n\nWriter(s)\nZak Garriss\n\n\nComposer(s)\nDaughter\n\n\nEngine\nUnity\n\n\nPlatform(s)\n\n\n\nMicrosoft Windows\nPlayStation 4\nXbox One\n\n\n\n\n\nRelease\n\n\n\nEpisode 1\n\n\nWW: 31 August 2017\n\n\n\n\n\n\nEpisode 2\n\n\nWW: 19 October 2017\n\n\n\n\n\n\nEpisode 3\n\n\nWW: 20 December 2017\n\n\n\n\n\n\n\nGenre(s)\nGraphic adventure\n\n\nMode(s)\nSingle-player"
}, {
  "title" : "Sodom and Gomorrah",
  "query" : "where is sodom and gomorrah located in the bible",
  "short_answer" : "on the Jordan River plain in the southern region of the land of Canaan",
  "long_answer" : "According to the Torah, the kingdoms of Sodom and Gomorrah were allied with the cities of Admah, Zeboim and Bela. These five cities, also known as the \"cities of the plain\" (from Genesis in the Authorized Version), were situated on the Jordan River plain in the southern region of the land of Canaan. The plain, which corresponds to the area just north of the modern-day Dead Sea, was compared to the garden of Eden[Gen.13:10] as being well-watered and green, suitable for grazing livestock."
}, {
  "title" : "Xbox 360",
  "query" : "when did the xbox 360 slim come out",
  "short_answer" : "in 2010",
  "long_answer" : "Two major hardware revisions of the Xbox 360 have succeeded the original models; the Xbox 360 S (also referred to as the \"Slim\") replaced the original \"Elite\" and \"Arcade\" models in 2010. The S model carries a smaller, streamlined appearance with an angular case, and utilizes a redesigned motherboard designed to alleviate the hardware and overheating issues experienced by prior models. It also includes a proprietary port for use with the Kinect sensor. The Xbox 360 E, a further streamlined variation of the 360 S with a two-tone rectangular case inspired by Xbox One, was released in 2013. In addition to its revised aesthetics, the Xbox 360 E also has one fewer USB port, no AV connector (and thus is HDMI-only), and no longer supports S/PDIF."
}, {
  "title" : "Philosophy of mind",
  "query" : "who spread the theory that one is a product of the mind and body",
  "short_answer" : "René Descartes",
  "long_answer" : "In Western Philosophy, the earliest discussions of dualist ideas are in the writings of Plato who maintained that humans' \"intelligence\" (a faculty of the mind or soul) could not be identified with, or explained in terms of, their physical body. However, the best-known version of dualism is due to René Descartes (1641), and holds that the mind is a non-extended, non-physical substance, a \"res cogitans\". Descartes was the first to clearly identify the mind with consciousness and self-awareness, and to distinguish this from the brain, which was the seat of intelligence. He was therefore the first to formulate the mind–body problem in the form in which it still exists today."
}, {
  "title" : "Cristiano Ronaldo",
  "query" : "how many goals scored ronaldo in his career",
  "short_answer" : "over 670",
  "long_answer" : "Cristiano Ronaldo dos Santos Aveiro GOIH ComM (European Portuguese: [kɾiʃˈtjɐnu ʁoˈnaɫdu]; born 5 February 1985) is a Portuguese professional footballer who plays as a forward for Italian club Juventus and the Portugal national team. Often considered the best player in the world and  regarded by many as one of the greatest players of all time, Ronaldo has a record-tying five Ballon d'Or awards,[note 2] the most for a European player, and is the first player to win four European Golden Shoes. He has won 26 trophies in his career, including five league titles, five UEFA Champions League titles and one UEFA European Championship. A prolific goalscorer, Ronaldo holds the records for most official goals scored in Europe's top-five leagues (395), the UEFA Champions League (120), the UEFA European Championship (9), as well as those for most assists in the UEFA Champions League (34) and the UEFA European Championship (6). He has scored over 670 senior career goals for club and country."
}, {
  "title" : "Della Reese",
  "query" : "who played tess on touched by an angel",
  "short_answer" : "Delloreese Patricia Early (July 6, 1931 – November 19, 2017), known professionally as Della Reese",
  "long_answer" : "Delloreese Patricia Early (July 6, 1931 – November 19, 2017), known professionally as Della Reese, was an American jazz and gospel singer, actress, and ordained minister whose career spanned seven decades. Reese's long career began as a singer, scoring a hit with her 1959 single \"Don't You Know?\". In the late–1960s, Reese hosted her own talk show, Della, which ran for 197 episodes. She also starred in films beginning in 1975, including playing opposite Redd Foxx in Harlem Nights (1989), Martin Lawrence in A Thin Line Between Love and Hate (1996) and Elliott Gould in Expecting Mary (2010). She achieved continuing success in the television religious supernatural drama Touched by an Angel (1994–2003), in which Reese played the leading role of Tess."
}, {
  "title" : "New Orleans Pelicans",
  "query" : "when did the hornets move to new orleans",
  "short_answer" : "2002–03 season",
  "long_answer" : "The Pelicans were established as the New Orleans Hornets in the 2002–03 season when then-owner of the Charlotte Hornets, George Shinn, relocated the franchise to New Orleans. Due to the damage caused by Hurricane Katrina in 2005, the franchise temporarily relocated to Oklahoma City, where they spent two seasons officially known as the New Orleans/Oklahoma City Hornets. The team returned to New Orleans full-time for the 2007–08 season. On January 24, 2013, the franchise announced it would rename itself the Pelicans, effective after the conclusion of the 2012–13 season. The Charlotte Hornets name, history and records from 1988 to 2002 were returned to its original city to be used by the then–Charlotte Bobcats franchise, which subsequently became the Charlotte Hornets, starting May 20, 2014."
}, {
  "title" : "Evolution of fish",
  "query" : "fish appeared in the fossil record during the",
  "short_answer" : "the Cambrian explosion",
  "long_answer" : "The evolution of fish began about 530 million years ago during the Cambrian explosion. It was during this time that the early chordates developed the skull and the vertebral column, leading to the first craniates and vertebrates. The first fish lineages belong to the Agnatha, or jawless fish. Early examples include Haikouichthys. During the late Cambrian, eel-like jawless fish called the conodonts, and small mostly armoured fish known as ostracoderms, first appeared. Most jawless fish are now extinct; but the extant lampreys may approximate ancient pre-jawed fish. Lampreys belong to the Cyclostomata, which includes the extant hagfish, and this group may have split early on from other agnathans."
}, {
  "title" : "Faith No More",
  "query" : "who died from the band faith no more",
  "short_answer" : "singer Chuck Mosley",
  "long_answer" : "Former Faith No More singer Chuck Mosley died on November 9, 2017, due to \"the disease of addiction.\" He was 57 years old."
}, {
  "title" : "Gun Control Act of 1968",
  "query" : "who signed the gun control act of 1968",
  "short_answer" : "President Lyndon B. Johnson",
  "long_answer" : "The GCA was signed into law by President Lyndon B. Johnson on October 22, 1968, and is Title I of the U.S. federal firearms laws. The National Firearms Act of 1934 (NFA) is Title II. Both GCA and NFA are enforced by the Bureau of Alcohol, Tobacco, Firearms and Explosives (ATF)."
}, {
  "title" : "Frankenstein",
  "query" : "where do frankenstein and the monster first meet",
  "short_answer" : "the mountains",
  "long_answer" : "Ravaged by grief and guilt, Victor retreats into the mountains. The Creature finds him and pleads for Victor to hear his tale."
}, {
  "title" : "Mirroring (psychology)",
  "query" : "the human tendency to mimic other people’s behavior is an example of",
  "short_answer" : "Mirroring",
  "long_answer" : "Mirroring is the behaviour in which one person subconsciously imitates the gesture, speech pattern, or attitude of another. Mirroring often occurs in social situations, particularly in the company of close friends or family. The concept often affects other individuals' notions about the individual that is exhibiting mirroring behaviors, which can lead to the individual building rapport with others."
}, {
  "title" : "The Killing (U.S. TV series)",
  "query" : "when does season five of the killing come out",
  "short_answer" : "a fourth season consisting of six episodes to conclude the series",
  "long_answer" : "AMC announced the series' cancellation in July 2012, but picked it up for a third season after a renegotiation with Fox Television Studios and Netflix. The Killing was again cancelled by AMC in September 2013, but Netflix announced in November 2013 that it had ordered a fourth season consisting of six episodes to conclude the series. The complete fourth season was released on Netflix on August 1, 2014."
}, {
  "title" : "Church of England",
  "query" : "how is the head of the church of england",
  "short_answer" : "the monarch is the supreme governor",
  "long_answer" : "The Church of England (C of E) is the Established Church of England. The Archbishop of Canterbury is the most senior cleric, although the monarch is the supreme governor. The Church of England is also the mother church of the international Anglican Communion. It traces its history to the Christian church recorded as existing in the Roman province of Britain by the third century, and to the 6th-century Gregorian mission to Kent led by Augustine of Canterbury."
} ]